Revit 2026 API

# TemperatureRatingTypeSet Constructor

---

Initializes a new instance of the TemperatureRatingTypeSet class

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TemperatureRatingTypeSet()
```
```vb
Public Sub New
```
```cpp
public:
TemperatureRatingTypeSet()
```
```fsharp
new : unit -> TemperatureRatingTypeSet
```

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace